ЭкзаменационнаяЗадача/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <comment>Сотрудник, с которым связан пользователь</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЭкзаменационнаяЗадача/src/CommonModules/ПолучениеДанныхТекущегоСеансаСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для Получения ссылок на сотрудника и ресторан текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на сотрудника текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на ресторан текущего пользователя;//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Вернуть значение параметра сеанса текущий пользователь.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Вернуть значение параметра сеанса текущий пользователь
Функция ВернутьЗначениеПараметраСеансаТекущийПользователь () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

Функция ПолучитьСсылкуТекущегоПользователяИБ(ИдентификаторПользователяИБ) Экспорт
	
	Результат = Справочники.Пользователи.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВернутьЗначениеПараметраСеансаТекущийМагазин() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийМагазин;
	
КонецФункции

Функция ПолучитьСсылкуТекущегоМагазина(ИдентификаторПользователяИБ) Экспорт
	
	Результат = Справочники.Магазины.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Магазин КАК Магазин
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО Пользователи.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Магазин;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти
